[
  {
    "lesson": 1,
    "title": "Understanding Piano Notes",
    "content": "Let's start with the basics! The piano keyboard has a pattern of black and white keys. The white keys are named using letters from A to G. Look at the piano below - notice how this pattern repeats across the keyboard. The black keys are called sharps (♯) when named after the white key below them, or flats (♭) when named after the white key above them. For example, the black key between C and D can be called either C♯ or D♭. Let's explore the C major scale to understand this pattern!",
    "type": "interactive",
    "scale": ["C4", "D4", "E4", "F4", "G4", "A4", "B4", "C5"]
  },
  {
    "lesson": 2,
    "title": "Understanding Intervals",
    "content": "Intervals are the distances between notes. The smallest interval is a half step (from one key to the very next key, including black keys). A whole step is two half steps. Try playing both to hear the difference!"
  },
  {
    "lesson": 3,
    "title": "Major vs Minor: The Emotional Color of Music",
    "content": "Major and minor chords create different emotional responses in music. Major chords often sound bright, happy, and uplifting, while minor chords tend to sound more melancholic, mysterious, or sad. Many songs use this to set their emotional tone. Famous examples in major key include 'Hey Jude' by The Beatles and 'Don't Stop Believin'' by Journey. Well-known minor key songs include 'Nothing Else Matters' by Metallica and 'Eleanor Rigby' by The Beatles. Let's hear the difference with 'A Whole New World' from Aladdin played in both major (original) and minor keys. Click the buttons below to hear how the same melody can create completely different emotional experiences!",
    "audio": {
      "major": "whole_new_world_major.mp3",
      "minor": "whole_new_world_minor.mp3"
    }
  },
  {
    "lesson": 4,
    "title": "Building Chords",
    "content": "A chord is built by playing three or more notes together. The most common chords are built using three notes: the root (starting note), the third (3rd note up), and the fifth (5th note up). The difference between major and minor chords lies in the third - major chords use a major third (4 half steps up), while minor chords use a minor third (3 half steps up). Let's look at C major and C minor chords. In C major, we use C (root) + E (major 3rd) + G (5th). In C minor, we use C (root) + Eb (minor 3rd) + G (5th). Click the buttons to hear how they sound!",
    "chords": {
      "major": {
        "notes": ["C4", "E4", "G4"],
        "title": "C Major"
      },
      "minor": {
        "notes": ["C4", "Eb4", "G4"],
        "title": "C Minor"
      }
    }
  },
  {
    "lesson": 5,
    "title": "Build Your Own Chords",
    "content": "Now it's your turn! Try to build G major and G minor chords. For G major, use G (root) + B (major 3rd) + D (5th). For G minor, use G (root) + Bb (minor 3rd) + D (5th). Click the keys to select them, then check if you've built the chord correctly.",
    "chords": {
      "major": {
        "notes": ["G4", "B4", "D5"],
        "title": "G Major"
      },
      "minor": {
        "notes": ["G4", "Bb4", "D5"],
        "title": "G Minor Triad"
      }
    }
  },
  {
    "lesson": 6,
    "title": "Build Taylor Swift's Chord Progression",
    "content": "One of Taylor Swift's most used chord progressions is G major, D major, A minor, and C major. This progression appears in many of her hit songs including 'Love Story', 'You Belong With Me', and 'Fearless'. Before we see these chords in action, let's practice building each one! For G major, use G + B + D. For D major, use D + F# + A. For A minor, use A + C + E. For C major, use C + E + G. Click the keys to select them, then check if you've built each chord correctly.",
    "chords": {
      "g_major": {
        "notes": ["G4", "B4", "D5"],
        "title": "G Major"
      },
      "d_major": {
        "notes": ["D4", "F#4", "A4"],
        "title": "D Major"
      },
      "a_minor": {
        "notes": ["A3", "C4", "E4"],
        "title": "A Minor"
      },
      "c_major": {
        "notes": ["C4", "E4", "G4"],
        "title": "C Major"
      }
    }
  },
  {
    "lesson": 7,
    "title": "Taylor Swift Chord Progressions in Action",
    "content": "Many popular Taylor Swift songs use the same few chord progressions. In this lesson, we'll learn how four simple chords - G major, D major, A minor, and C major - can be used to play numerous Taylor Swift songs. Try playing each chord and notice how they sound together. These chord progressions create the foundation for many of her hit songs!",
    "video": "TSMusic.mp4",
    "chords": {
      "g_major": {
        "notes": ["G4", "B4", "D5"],
        "title": "G Major"
      },
      "d_major": {
        "notes": ["D4", "F#4", "A4"],
        "title": "D Major"
      },
      "a_minor": {
        "notes": ["A4", "C5", "E5"],
        "title": "A Minor"
      },
      "c_major": {
        "notes": ["C4", "E4", "G4"],
        "title": "C Major"
      }
    }
  },
  {
    "lesson": 8,
    "title": "Build Beyoncé's Halo Chord Progression",
    "content": "Beyoncé's hit song 'Halo' uses a beautiful chord progression that creates its emotional atmosphere. In this lesson, we'll practice building the four main chords used in this song: A major, B minor, F# minor, and D major. Click the keys to select them, then check if you've built each chord correctly.",
    "chords": {
      "a_major": {
        "notes": ["A3", "C#4", "E4"],
        "title": "A Major"
      },
      "b_minor": {
        "notes": ["B3", "D4", "F#4"],
        "title": "B Minor"
      },
      "f_sharp_minor": {
        "notes": ["F#3", "A3", "C#4"],
        "title": "F# Minor"
      },
      "d_major": {
        "notes": ["D3", "F#3", "A3"],
        "title": "D Major"
      }
    }
  },
  {
    "lesson": 9,
    "title": "Playing Along with Beyoncé's Halo",
    "content": "Now that you've learned the chords, let's play along with Beyoncé's 'Halo'. This song uses A major, B minor, F# minor, and D major chords to create its emotional atmosphere. Practice playing along with the video and try to match the rhythm of the chord changes.",
    "video": "Halo.mp4",
    "chords": {
      "a_major": {
        "notes": ["A3", "C#4", "E4"],
        "title": "A Major"
      },
      "b_minor": {
        "notes": ["B3", "D4", "F#4"],
        "title": "B Minor"
      },
      "f_sharp_minor": {
        "notes": ["F#3", "A3", "C#4"],
        "title": "F# Minor"
      },
      "d_major": {
        "notes": ["D3", "F#3", "A3"],
        "title": "D Major"
      }
    }
  }
]
